app/controllers/friendships_controller.rb

  def create
    friendship = Friendship.create(friendship_params)
    if friendship.valid?
      friend = User.find(friendship.friender_id)
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 19], ["friend_id", 19], ["created_at", "2023-01-05 15:21:22.983221"], ["updated_at", "2023-01-05 15:21:22.983221"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

  def destroy
    user = User.find_by(id: params[:user_id])
    friend = User.find_by(id: params[:friend_id])
    friendee_friendship = user.friendee_friendships.where(friender_id: friend.id)
    friender_friendship = user.friender_friendships.where(friendee_id: friend.id)
    if params[:user_id].to_i == session[:user_id]
      if friendee_friendship.size > 0
        friendee_invitations = friendee_friendship.first().get_invitations
        friendee_attendances = friendee_friendship.first().get_attendances
        friendee_friendship.each {|el| el.destroy}
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 19], ["friend_id", 19], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 1]]