app/controllers/friend_requests_controller.rb

INSERT INTO "friend_requests" ("requestor_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["requestor_id", 19], ["receiver_id", 1], ["created_at", "2023-01-05 12:20:48.010637"], ["updated_at", "2023-01-05 12:20:48.010637"]]
---
  def create
    request = FriendRequest.create(sender_id: params[:sender_id], receiver_id: params[:receiver_id])

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def get_sender
    request = FriendRequest.find(params[:id])

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."receiver_id" = $1  [["receiver_id", 19]]
---
  def show
    requests = FriendRequest.where(receiver_id: params[:id]).all

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "friend_requests" WHERE "friend_requests"."id" = $1  [["id", 3]]
---
  def destroy
      request = FriendRequest.find(params[:id])
      if request.sender_id == session[:user_id] || request.receiver_id == session[:user_id]
        user = User.find_by(id: request.receiver_id)
        request.delete