app/controllers/game_nights_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def get_packages
    user = User.find(params[:user_id])