app/controllers/game_nights_controller.rb

INSERT INTO "game_nights" ("date", "time", "owner_id", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2000-01-01"], ["time", "12:01:00"], ["owner_id", 20], ["location", "Nowhere"], ["created_at", "2023-01-07 12:38:56.795379"], ["updated_at", "2023-01-07 12:38:56.795379"]]
---
  def create
      gameNight = GameNight.create(game_night_params)

SELECT "game_nights".* FROM "game_nights" WHERE "game_nights"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def show
      gameNight = GameNight.find_by(id: params[:id])

SELECT "game_nights".* FROM "game_nights" WHERE "game_nights"."owner_id" = $1  [["owner_id", 19]]
---
  def get_nights
    user_nights = GameNight.where(owner_id: params[:user_id]).all

SELECT "game_nights".* FROM "game_nights" WHERE "game_nights"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def get_attendees
    night = GameNight.find(params[:id])
    attendances = night.attendances.all

SELECT "game_nights".* FROM "game_nights" WHERE "game_nights"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "game_nights" WHERE "game_nights"."id" = $1  [["id", 12]]
---
  def destroy
      gameNight = GameNight.find_by(id: params[:id])
      gameNight.delete