app/controllers/games_controller.rb

  def find
    #note the use of lower() to downcase the title
    games = Game.where('lower(title) LIKE ?', '%' + params[:query].downcase + '%').all
    user = User.find(params[:user_id])
    user_games = user.user_games
    owner_games = user_games.map {|user_game| user_game.game}
    originator_games = user.originator_games
    matched_originator_games = []
    unmatched_originator_games = []
    matched_owner_games = []
    unmatched_owner_games = []
    if originator_games.size > 0
---
SELECT "games".* FROM "games" WHERE (lower(title) LIKE '%car%')
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE (lower(title) LIKE '%%')
SELECT COUNT(*) FROM "games" WHERE (lower(title) LIKE '%%')

  def show
      game = Game.find_by(id: params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]