app/controllers/messages_controller.rb

  def create
    message = Message.create(message_params)
---
INSERT INTO "messages" ("sender_id", "receiver_id", "topic", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["sender_id", 19], ["receiver_id", 1], ["topic", "History"], ["body", "It repeats itself."], ["created_at", "2023-01-05 19:42:27.199334"], ["updated_at", "2023-01-05 19:42:27.199334"]]

  def get_messages
    messages = Message.where(receiver_id: params[:user_id]).all
---
SELECT "messages".* FROM "messages" WHERE "messages"."receiver_id" = $1  [["receiver_id", 1]]