app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "blurb", "dob", "pronouns", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "acamus"]]
SELECT COUNT(*) FROM "users" WHERE (username LIKE '%z%')
---
    def find
        users = User.where('username LIKE ?', '%' + params[:query] + '%').all
        if users.size > 0

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def self
      user = User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def friends
      user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$ReWfkM7crN5OAwiPIX8dW.3fPIZLdKGrkLA1E/rmOKgKwuAkGD3/2"], ["updated_at", "2023-01-04 15:55:30.566906"], ["id", 19]]
---
    def update
        user = User.find_by(id: session[:user_id])
        user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 15]]
---
    def destroy
        user = User.find_by(id: session[:user_id])
        user.delete