app/controllers/user_games_controller.rb

SELECT "user_games".* FROM "user_games" WHERE "user_games"."owner_id" = $1 LIMIT $2  [["owner_id", 19], ["LIMIT", 1]]
SELECT "user_games".* FROM "user_games" WHERE "user_games"."owner_id" = $1  [["owner_id", 19]]
---
  def get_games
    user_games = UserGame.where(owner_id: params[:user_id]).all
    games = user_games.map { |usergame| usergame.game }